Revit 2027 API
StructuralInstanceUsageFilter(StructuralInstanceUsage) Constructor
 Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralInstanceUsageFilter(
	StructuralInstanceUsage structuralUsage
)
Public Sub New (
	structuralUsage As StructuralInstanceUsage
)
public:
StructuralInstanceUsageFilter(
	StructuralInstanceUsage structuralUsage
)
new :
        structuralUsage : StructuralInstanceUsage -> StructuralInstanceUsageFilter
Parameters
structuralUsage StructuralInstanceUsage
 The family instance structural usage.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralInstanceUsageFilter Class
StructuralInstanceUsageFilter Overload
Autodesk.Revit.DB.Structure Namespace